import { createStore } from 'vuex';
import { Store } from '@/store/store';

export default createStore<Store>({
  state: {
    selectedDate: false,
  },
  getters: {
    personalNumber: (state) => {
      const { selectedDate: newDate } = state;
      if (!newDate) { return false; }
      const day = newDate.getDate();
      const month = newDate.getMonth() + 1;
      const year = newDate.getFullYear();
      const numbers = [
        ...day.toString().split('').map((num) => parseInt(num, 10)),
        ...month.toString().split('').map((num) => parseInt(num, 10)),
        ...year.toString().split('').map((num) => parseInt(num, 10)),
      ];

      const calculateSum = (input: number[]): string => input.reduce((acc, current) => {
        const sum = acc + current;
        return sum;
      }, 0).toString(10);

      let result = calculateSum(numbers);

      while (result.length !== 1) {
        result = calculateSum(result.split('').map((num) => parseInt(num, 10)));
      }

      return result;
    },
    getDescription: (state, getters) => {
      if (!getters.personalNumber) {
        return false;
      }
      const result = parseInt(getters.personalNumber, 10);
      const descriptions: Record<string, string> = {
        1: `Тези, които имат лично число 1 са амбициозни и пробивни. Те обичат да докарват нещата до край.
Тяхната способност да се концентрират е невероятна и те са способни да се съсредоточат независимо от хаоса наоколо.
Хората, които носят единицата, като лично число, обикновено са обективни, способни да взимат сериозни решения с лекота.
Понякога тези хора са големи инати и егоцентрични. Когато им се постави точно определена цел, те я следват неотклонно,
докато я изпълнят. В такъв случай, целта засенчва егото им и те загърбват идентичността си, само за да постигнат целта,
която имат пред себе си. Това прави вибрацията на единицата успешна.
        `,
        2: `
        Тези, които имат лично число 2, са честни, може да има се има доверие и често сменят настроенията си. Тези хора са много талантливи и обикновено имат страшно много прекрасни идеи. Те често така ги разконцентрират, че се заемат с няколко неща наведнъж и това обикновено не води до добри резултати. Те често са философи и към тях може да се обърнете, когато имате нужда от искрен съвет. Притежателите на числото 2 са надарени с дарбата да събират хората заедно. Те са добри посредници при преговори.
        `,
        3: `
Хората с това число обикновено са щастливци. Те винаги са на точното място в точното време. Те също имат способността да взимат правилни решения. Те са изключително инициативни и интелигентни. Тези, които притежават това число са многокреативни и са много добри в комуникацията. Те могат да бъдат манипулативни, но често подбудите им са съвсем добри.
        `,
        4: `


Както може да очакваме, хората представители на 4-ката са стабилни и уравновесени натури. Те изпипват нещата. Ако някаква работа трябва да бъде свършена с точност в детайлите, те са хората, към които трябва да се обърнете. Те с лекота се справят с трудните проекти, предават ги сметодическа точност и навреме. Те се стремят да имат ред в живота си и понякога остават грешно разбрани. Това все пак не ги дразни толкова, защото те разбират важността на позицията си и ролята, която играят в живота на другите.
        `,
        5: `
Хората, които притежават това число са много общителни и често играят активна роля в обществото. Те притежават висок дух и обичат да пътуват. Не си падат по рутината и се адаптират бърэо към нови ситуации. Те се справят спредизвикателствата с разум и нетрадиционни решения. 5тиците имат много проекти и идеи едновременно и докато се опитват да ги осъществяват, те се провалят в някои от тях, но това съвсем не ги тревожи и те продължават напред.
        `,
        6: `
        Хората, които имат това число са креативни, но противоречиви и често е нужно да дават пояснения на действията си. Те са много добри в сметките и са много интелигентни и лесно намират общ език с хората. Тези хора са любители на хармонията и не харесват противопоставянето, затова предпочитат „да правят любов, а не война“. Те са пацифисти и приемат на сериозно ролята си на помощници и спасители на обществото.
        `,
        7: `
Хората, които го притежават са учени и поети. Те са много интелигентни и притежават невероятни аналитични умения. Въпреки това съзнанието им е в мечтите им, където те лесно могат да преместват нещата и събитията, така както искат. Тяхната реалност се различава твърде много от тази на останалите-това е реалност, която те самите са си създали. Тези хора имат способността да събират перфектните хора, места и събития в живота си, което ги води по пътя към непрекъснато обновление.
        `,
        8: `
Хората, които имат лично число 8 са изключително успешни-главно в бизнес, в който успехът се основава на прогресът, на който му е нужно малко време. Тези хора са способни да предвиждат обстоятелствата и тенденциите и да са нагребена на вълната, което е техният голям успех. Те също така добре разбират, кога трябва да отклоняват предложения, заради особената си интуиция, която им позволява да видят цикличността на нещата. Притежателите на 8-цата са много добри на игри на късмета, както и на борсите на ценни книжа, както и всякакви сделки, чийто успех се базира на определена статистика.
        `,
        9: `
        Тези, които притежават числото 9 са магнетични, чаровни и представят себе си с лекота и увереност. Те са запознати с безброй теми, и са готови да изразяват уменията си в привидно безброй арени. Когато имат поле за изява, тези хора създават невероятни подвизи при изпълнението си. Тези хора са много обаятелни и лесно ръководят групи от хора. Перфектни са за ръководители и властници, които биха управлявали разумно и мъдро.
        `,
      };
      if (result in descriptions) {
        return descriptions[result];
      }
      throw new Error('Unknown number passed');
    },
  },
  mutations: {
    updateDate: (state, payload) => {
      state.selectedDate = payload.selectedDate;
    },
  },
  actions: {
  },
  modules: {
  },
});
